const studentsDatabase = {
            "first": {
                "214": {
                    "name": "مازن خالد حماده عبدالرحمن السمخراطي",
                    "scores": {
                        
                  "اللغة العربية": 60,
      "اللغة الإنجليزية": 59,
      "الرياضيات": 59,
      "العلوم المتكامله": 60,
      "التاريخ": 59,
      "الجغرافيا": 58
                        
                        
                        
                        
                    }
                },
                "12346": {
                    "name": "فاطمة أحمد حسن",
                    "scores": {
                        "اللغة العربية": 19,
                        "اللغة الإنجليزية": 18,
                        "الرياضيات": 17,
                        "الفيزياء": 18,
                        "الكيمياء": 19,
                        "الأحياء": 18,
                        "التاريخ": 17,
                        "الجغرافيا": 19
                    }
                }
            },
            "second": {
                "scientific": {
                    
                    
                    
                    
                    
                   
  "698": {
    "name": "يوسف خالد جابر ابرايم",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 50,
      "الرياضيات": 40,
      "الأحياء": 45,
      "الفيزياء": 40,
      "الكيمياء": 55
    }
  },
  "513": {
    "name": "احمد رمضان حلمي سالم",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 55,
      "الرياضيات": 43,
      "الأحياء": 40,
      "الفيزياء": 40,
      "الكيمياء": 35
    }
  
},

  "679": {
    "name": "مصطفي عماد صبحي رجب علي مهدي",
    "scores": {
      "اللغة العربية": 70,
      "اللغة الأجنبية الأولى": 59,
      "الرياضيات": 55,
      "الأحياء": 56,
      "الفيزياء": 54,
      "الكيمياء": 59
    }
  },
  "678": {
    "name": "مصطفي عبد المنصف محمد عبد المعطي بدر",
    "scores": {
      "اللغة العربية": 77,
      "اللغة الأجنبية الأولى": 55,
      "الرياضيات": 59,
      "الأحياء": 56,
      "الفيزياء": 58,
      "الكيمياء": 50
    }
  },
  "30810011810434": {
    "name": "طارق عبد الناصر فهيم راغب ",
    "scores": {
      "اللغة العربية": 60,
      "اللغة الأجنبية الأولى": 49,
      "الرياضيات": 50,
      "الأحياء": 55,
      "الفيزياء": 45,
      "الكيمياء": 49
    }
  }
  ,
  "700": {
    "name": "يوسف رمضان سعد عرابى",
    "scores": {
      "اللغة العربية": 65,
      "اللغة الأجنبية الأولى": 52,
      "الرياضيات": 49,
      "الأحياء": 53,
      "الفيزياء": 54,
      "الكيمياء": 55
    }
  },
  "623": {
    "name": "محمد بشير موسي",
    "scores": {
      "اللغة العربية": 68,
      "اللغة الأجنبية الأولى": 51,
      "الرياضيات": 48,
      "الأحياء": 54,
      "الفيزياء": 55,
      "الكيمياء": 55
    }
  },
  "575": {
    "name": "عبدالرحمن جمعه مرسي محمود سلطح",
    "scores": {
      "اللغة العربية": 75,
      "اللغة الأجنبية الأولى": 55,
      "الرياضيات": 55,
      "الأحياء": 55,
      "الفيزياء": 55,
      "الكيمياء": 55
    }
  
}
 ,"702": {
    "name": "Youssef Salama",
    "scores": {
      "اللغة العربية": 65,
      "اللغة الأجنبية الأولى": 40,
      "الرياضيات": 30,
      "الأحياء": 53,
      "الفيزياء": 43,
      "الكيمياء": 36
    }
  }, "779": {
    "name": "يوسف مجدى سعد احمد",
    "scores": {
      "اللغة العربية": 78,
      "اللغة الأجنبية الأولى": 56,
      "الرياضيات": 50,
      "الأحياء": 57,
      "الفيزياء": 53,
      "الكيمياء": 58
    }
  },
 "678": {
    "name": "مؤمن أحمد مسعد أحمد",
    "scores": {
      "اللغة العربية": 65,
      "اللغة الأجنبية الأولى": 51,
      "الرياضيات": 53,
      "الأحياء": 55,
      "الفيزياء": 56,
      "الكيمياء": 53
    }
  },
  "762": {
    "name": "محمد راشد محمد عبدالعزيز راشد",
    "scores": {
      "اللغة العربية": 72,
      "اللغة الأجنبية الأولى": 53,
      "الرياضيات": 47,
      "الأحياء": 49,
      "الفيزياء": 54,
      "الكيمياء": 49
    }
  },
   "723": {
    "name": "أحمد كارم جبيلي محمد عبدالنبى",
    "scores": {
      "اللغة العربية": 65,
      "اللغة الأجنبية الأولى": 53,
      "الرياضيات": 51,
      "الأحياء": 50,
      "الفيزياء": 53,
      "الكيمياء": 56
    }
  }




                    
                    
                },
                "literary": {
                    "34567": {
                        "name": "زينب محمد إبراهيم",
                        "scores": {
                            "اللغة العربية": 19,
                            "اللغة الإنجليزية": 18,
                            "التاريخ": 20,
                            "الجغرافيا": 19,
                            "الفلسفة": 18,
                            "علم النفس": 19,
                            "اللغة الفرنسية": 17
                        }
                    }
                }
            }
        };

       
